{
  "backend/main.mo": "Motoko canister implementing user profiles, posts, social interactions, and access-control‑gated CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping branding‑related features to affected frontend files and component versions.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing their roles in routing, UI, hooks, and components.",
  "frontend/index.css": "Tailwind CSS base definitions with light/dark theme variables and global styling rules.",
  "frontend/index.html": "HTML entry document setting metadata and loading the React app with the Josh title.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and wrapping content in layout, theming, and toaster providers.",
  "frontend/src/components/auth/AuthButton.tsx": "Login/logout button handling Internet Identity authentication and query cache resets.",
  "frontend/src/components/auth/AuthRequired.tsx": "Wrapper that restricts child UI to authenticated users or shows a sign‑in prompt.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first‑time profile creation with form fields and backend save integration.",
  "frontend/src/components/empty/EmptyFeedState.tsx": "Empty feed UI showing illustration and calls to action for creating posts or exploring users.",
  "frontend/src/components/feed/FeedList.tsx": "Renders a list of PostCards with loading handling and optional pagination load‑more button.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, footer, navigation, and profile setup dialog wrapping page content.",
  "frontend/src/components/layout/AppNav.tsx": "Renders desktop navigation buttons with routing and auth-based visibility.",
  "frontend/src/components/layout/BottomTabNav.tsx": "Provides mobile bottom navigation with auth checks and active-state styling.",
  "frontend/src/components/posts/PostActions.tsx": "Displays like, repost, and reply actions for a post with auth gating and mutation handlers.",
  "frontend/src/components/posts/PostCard.tsx": "Shows a post with author info, timestamp, content, and actions, linking to profile and post pages.",
  "frontend/src/components/posts/PostComposer.tsx": "Form for creating posts or replies with validation, character limits, and submission handling.",
  "frontend/src/components/profile/FollowButton.tsx": "Follow/unfollow button using mutations and auth checks, reflecting current follow state.",
  "frontend/src/components/profile/ProfileHeader.tsx": "Displays a user’s profile header with avatar, bio, stats, and a follow button when appropriate.",
  "frontend/src/components/search/SearchResults.tsx": "Renders search results for users and posts with loading and empty states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity, reinitializing and invalidating queries on change.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value updated after a delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, including login, logout, and identity status handling. Wraps AuthClient creation with custom options and exposes a hook for accessing identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, posts, feeds, and social interactions via an actor. Provides structured query keys and invalidates caches on mutations.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and global styles. Includes base styling, safe-area padding support, and utility layers.",
  "frontend/src/main.tsx": "Initializes the React app by mounting it with QueryClientProvider and InternetIdentityProvider. Imports global styles and renders the main App component.",
  "frontend/src/pages/ComposePage.tsx": "Page for creating new posts, requiring user identity and using PostComposer. Redirects to home after successful post creation.",
  "frontend/src/pages/ExplorePage.tsx": "Explore page supporting search across users and posts with debouncing and fallback to recent feed. Uses tabs to switch between search result types.",
  "frontend/src/pages/HomePage.tsx": "Home feed page showing public or personalized posts with pagination. Displays an empty state when no posts are available.",
  "frontend/src/pages/PostDetailPage.tsx": "Shows a single post with loading states, reply composer, and filtered replies. Fetches full feed to derive replies client‑side.",
  "frontend/src/pages/ProfilePage.tsx": "Displays a user profile and their posts, with loading and not‑found states. Filters posts by author to build the profile feed.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters. Supports hash-based routing and persistence via sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom color palette via CSS variables, extended theme options, and typography/container-query/animation plugins.",
  "project_state.json": "Project metadata describing current app state, issues, required images, and a list of existing implemented features for a Threads-like app."
}