{
  "backend/main.mo": "Defines user profiles, posts, and social interactions with access control and CRUD operations for profiles and posts.",
  "feature_evidence.json": "Declares a feature evidence report showing the deployment change to josh.caffeine.xyz and related impacted files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend source files for reference or documentation.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light/dark theme CSS variables and base styles.",
  "frontend/index.html": "HTML entry point setting metadata, canonical URL, and loading the main frontend script.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, route definitions, layout wrapper, and theme provider for the app.",
  "frontend/src/components/auth/AuthButton.tsx": "Login/logout button handling Internet Identity authentication and query cache clearing.",
  "frontend/src/components/auth/AuthRequired.tsx": "Wrapper requiring authentication to show children or providing a sign‑in fallback.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "First‑time profile setup modal allowing users to create or edit profile details.",
  "frontend/src/components/empty/EmptyFeedState.tsx": "Empty feed UI prompting users to create a post or explore users.",
  "frontend/src/components/feed/FeedList.tsx": "Renders a list of PostCards with loading and pagination support.",
  "frontend/src/components/layout/AppLayout.tsx": "Overall app layout with header, navigation, footer, and profile setup dialog injection.",
  "frontend/src/components/layout/AppNav.tsx": "Desktop navigation bar that builds route buttons, conditionally showing authenticated routes based on identity.",
  "frontend/src/components/layout/BottomTabNav.tsx": "Mobile bottom navigation bar handling auth-gated routes with login fallback and active-state styling.",
  "frontend/src/components/posts/PostActions.tsx": "Displays like, repost, and reply buttons for a post with mutation handlers and auth-required fallbacks.",
  "frontend/src/components/posts/PostCard.tsx": "Renders a post preview with author info, timestamp, content, and embedded PostActions, linking to profiles and post details.",
  "frontend/src/components/posts/PostComposer.tsx": "Form for creating posts or replies with character limits, mutation handling, and success or error toasts.",
  "frontend/src/components/profile/FollowButton.tsx": "Follow/unfollow button that checks current following state and triggers follow mutations with auth handling.",
  "frontend/src/components/profile/ProfileHeader.tsx": "Displays a profile’s avatar, name, bio, stats, and a follow button unless viewing own profile.",
  "frontend/src/components/search/SearchResults.tsx": "Shows search results for users and posts, including loading, empty states, and navigation to profiles or posts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value that updates after a delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a context and provider for managing Internet Identity authentication, including loading, login, logout, and status handling using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, posts, feeds, and social interactions through the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration defining theme variables, dark mode styles, and global base styles.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/ComposePage.tsx": "Page for creating new posts, requiring user identity and rendering a post composer.",
  "frontend/src/pages/ExplorePage.tsx": "Explore page with search for users and posts, switching between search results and a recent posts feed.",
  "frontend/src/pages/HomePage.tsx": "Home feed page showing personalized or public posts with pagination support.",
  "frontend/src/pages/PostDetailPage.tsx": "Displays a single post, its replies, and allows authenticated users to submit a reply.",
  "frontend/src/pages/ProfilePage.tsx": "Shows a user profile and lists posts authored by the specified principal.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors using CSS variables, extended theme settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project's current state, including versioning, goals, features, and a known issue about the app title in deployment."
}